In [17]:
import pandas as pd

In [18]:
df = pd.read_excel("HUL-master-excel.xlsx")

In [19]:
df.head()

        date  nifty_close  hul_close  goi_5y_yield
0 2015-03-02      8956.75     935.65         7.811
1 2015-03-03      8996.25     929.70         7.841
2 2015-03-04      8922.65     916.10         7.744
3 2015-03-05      8937.75     939.70         7.759
4 2015-03-09      8756.75     976.00         7.798

In [20]:
df_daily = df.copy()

In [21]:
df_daily.head()

        date  nifty_close  hul_close  goi_5y_yield
0 2015-03-02      8956.75     935.65         7.811
1 2015-03-03      8996.25     929.70         7.841
2 2015-03-04      8922.65     916.10         7.744
3 2015-03-05      8937.75     939.70         7.759
4 2015-03-09      8756.75     976.00         7.798

In [22]:
df_weekly = df.copy()

In [23]:
df_weekly.head()

        date  nifty_close  hul_close  goi_5y_yield
0 2015-03-02      8956.75     935.65         7.811
1 2015-03-03      8996.25     929.70         7.841
2 2015-03-04      8922.65     916.10         7.744
3 2015-03-05      8937.75     939.70         7.759
4 2015-03-09      8756.75     976.00         7.798

In [24]:
df_monthly = df.copy()
df_monthly.head()

        date  nifty_close  hul_close  goi_5y_yield
0 2015-03-02      8956.75     935.65         7.811
1 2015-03-03      8996.25     929.70         7.841
2 2015-03-04      8922.65     916.10         7.744
3 2015-03-05      8937.75     939.70         7.759
4 2015-03-09      8756.75     976.00         7.798

focus on `df_weekly`

In [25]:
df_weekly['date'] = pd.to_datetime(df_weekly['date'])

In [26]:
df_weekly.set_index('date', inplace=True)

In [27]:
weekly_first = df_weekly.resample('W').first().dropna()
df_weekly = weekly_first
df_weekly.head()

            nifty_close  hul_close  goi_5y_yield
date
2015-03-08      8956.75     935.65         7.811
2015-03-15      8756.75     976.00         7.798
2015-03-22      8633.15     931.75         7.879
2015-03-29      8550.90     902.40         7.798
2015-04-05      8492.30     862.05         7.783

In [28]:
covid_end_date = '2023-05-11'

In [29]:
df_weekly = df_weekly[df_weekly.index > covid_end_date]

In [30]:
df_weekly.head()

            nifty_close  hul_close  goi_5y_yield
date
2023-05-14     18264.40    2516.30         6.981
2023-05-21     18398.85    2662.25         6.963
2023-05-28     18314.40    2638.10         6.871
2023-06-04     18598.65    2650.30         6.967
2023-06-11     18593.85    2695.80         6.918

In [31]:
df_weekly.to_excel("weekly-data.xlsx", index=True)

focus on `df_monthly`

In [32]:
df_monthly['date'] = pd.to_datetime(df_monthly['date'])

In [33]:
df_monthly.set_index('date', inplace=True)

In [36]:
monthly_first = df_monthly.resample('ME').first().dropna()
df_monthly = monthly_first
df_monthly.head()

            nifty_close  hul_close  goi_5y_yield
date
2015-03-31      8956.75     935.65         7.811
2015-04-30      8586.25     883.50         7.746
2015-05-31      8331.95     861.75         7.880
2015-06-30      8433.40     880.80         7.853
2015-07-31      8453.05     918.30         8.031

In [38]:
df_monthly = df_monthly[df_monthly.index > covid_end_date]

In [39]:
df_monthly.head()

            nifty_close  hul_close  goi_5y_yield
date
2023-05-31     18147.65    2451.70         7.000
2023-06-30     18487.75    2697.90         6.906
2023-07-31     19322.55    2701.05         7.085
2023-08-31     19733.55    2551.10         7.130
2023-09-30     19435.30    2504.80         7.164

In [40]:
df_monthly.to_excel("monthly-data.xlsx", index=True)

finally, focus on `df_daily`

In [41]:
df_daily['date'] = pd.to_datetime(df_daily['date'])

In [43]:
df_daily.set_index('date', inplace=True)

In [44]:
df_daily = df_daily[df_daily.index > covid_end_date]

In [45]:
df_daily.head()

            nifty_close  hul_close  goi_5y_yield
date
2023-05-12     18314.80    2623.40         6.951
2023-05-15     18398.85    2662.25         6.963
2023-05-16     18286.50    2675.90         6.922
2023-05-17     18181.75    2661.75         6.906
2023-05-18     18129.95    2627.55         6.918

In [46]:
df_daily.to_excel("daily-data.xlsx", index=True)

---